app/controllers/users_controller.rb

INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "email") VALUES('ginger', '19347c827911ec5536a06aabbaa0a967613de1a131ac8f3dd422ec8eb71a7dcc', '660e012f23a259ee547c3fe1af25a30bdfd187b6510e891c19f277ef2776083e', '2010-09-05 12:40:02', '2010-09-05 12:40:02', 'ginger@email.com')
---
  def create
	@user = User.new(params[:user])
	if @user.save